Австралия/src/Catalogs/ProductsCategories/ProductsCategories.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ProductsCategories</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <predefined>
    <items>
      <name>MainGroup</name>
      <description>Main category</description>
    </items>
  </predefined>
  <attributes>
    <name>SetOfCharacteristicProperties</name>
    <type>
      <types>CatalogRef.AdditionalAttributesAndInfoSets</types>
    </type>
  </attributes>
  <attributes>
    <name>PropertySet</name>
    <type>
      <types>CatalogRef.AdditionalAttributesAndInfoSets</types>
    </type>
  </attributes>
  <attributes>
    <name>UseMatrixSelectionForm</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>UseBatches</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>UseCharacteristics</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>UseSerialNumbers</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>BatchSettings</name>
    <type>
      <types>CatalogRef.BatchSettings</types>
    </type>
  </attributes>
</mdclass:Catalog>

Австралия/src/Catalogs/AdditionalAttributesAndInfoSets/AdditionalAttributesAndInfoSets.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>AdditionalAttributesAndInfoSets</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Catalog_Products</name>
      <description>Catalog &quot;Products&quot;</description>
    </items>
    <items>
      <name>Catalog_ProductsCharacteristics</name>
      <description>Product variants</description>
    </items>
    <items>
      <name>Document_AccountingTransaction</name>
      <description>Accounting transaction</description>
    </items>
    <items>
      <name>Document_ActualSalesVolume</name>
      <description>Actual sales volume</description>
    </items>
    <items>
      <name>Document_BankReconciliation</name>
      <description>Bank reconciliation</description>
    </items>
    <items>
      <name>Catalog_Banks</name>
      <description>Banks</description>
    </items>
    <items>
      <name>Catalog_CashFlowItems</name>
      <description>Cash flow items</description>
    </items>
    <items>
      <name>Document_CashVoucher</name>
      <description>Cash payment</description>
    </items>
    <items>
      <name>Document_CashReceipt</name>
      <description>Cash receipt</description>
    </items>
    <items>
      <name>Catalog_Counterparties</name>
      <description>Catalog counterparties</description>
    </items>
    <items>
      <name>Catalog_Employees</name>
      <description>Catalog employees</description>
    </items>
    <items>
      <name>Catalog_SerialNumbers</name>
      <description>Catalog serial numbers</description>
    </items>
    <items>
      <name>Catalog_Companies</name>
      <description>Companies</description>
    </items>
    <items>
      <name>Catalog_ContactPersons</name>
      <description>Contact persons</description>
    </items>
    <items>
      <name>Catalog_CounterpartyContracts</name>
      <description>Counterparty's contracts</description>
    </items>
    <items>
      <name>Document_CreditNote</name>
      <description>Credit note</description>
    </items>
    <items>
      <name>Document_CustomsDeclaration</name>
      <description>Customs declaration</description>
    </items>
    <items>
      <name>Document_DebitNote</name>
      <description>Debit note</description>
    </items>
    <items>
      <name>Document_DirectDebit</name>
      <description>Direct debit</description>
    </items>
    <items>
      <name>Document_EmployeeTask</name>
      <description>Employee task</description>
    </items>
    <items>
      <name>Document_Event</name>
      <description>Event</description>
    </items>
    <items>
      <name>Document_PaymentExpense</name>
      <description>Expense</description>
    </items>
    <items>
      <name>Catalog_ExternalUsers</name>
      <description>External users</description>
    </items>
    <items>
      <name>Catalog_Files</name>
      <description>File</description>
    </items>
    <items>
      <name>Catalog_FileFolders</name>
      <description>Folder</description>
    </items>
    <items>
      <name>Document_ForeignCurrencyExchange</name>
      <description>Foreign currency exchange</description>
    </items>
    <items>
      <name>Document_GoodsIssue</name>
      <description>Goods issue</description>
    </items>
    <items>
      <name>Document_GoodsReceipt</name>
      <description>Goods receipt</description>
    </items>
    <items>
      <name>Document_IncomingEmail</name>
      <description>Incoming email message</description>
    </items>
    <items>
      <name>Catalog_Individuals</name>
      <description>Individuals</description>
    </items>
    <items>
      <name>Document_InventoryTransfer</name>
      <description>Inventory transfer</description>
    </items>
    <items>
      <name>Document_KitOrder</name>
      <description>Kit order</description>
    </items>
    <items>
      <name>Catalog_Leads</name>
      <description>Leads</description>
    </items>
    <items>
      <name>Catalog_LegalDocuments</name>
      <description>Legal documents</description>
    </items>
    <items>
      <name>Document_LoanContract</name>
      <description>Loan contract</description>
    </items>
    <items>
      <name>Document_LoanInterestCommissionAccruals</name>
      <description>Loan interest commission accruals</description>
    </items>
    <items>
      <name>Document_Meeting</name>
      <description>Meeting</description>
    </items>
    <items>
      <name>Document_OnlinePayment</name>
      <description>Online payment</description>
    </items>
    <items>
      <name>Document_OnlineReceipt</name>
      <description>Online receipt</description>
    </items>
    <items>
      <name>Document_OutgoingEmail</name>
      <description>Outgoing email message</description>
    </items>
    <items>
      <name>Document_PaymentReceipt</name>
      <description>Payment receipt</description>
    </items>
    <items>
      <name>Document_ExpenditureRequest</name>
      <description>Payment request</description>
    </items>
    <items>
      <name>Document_PhoneCall</name>
      <description>Phone call</description>
    </items>
    <items>
      <name>Catalog_ProductsBatches</name>
      <description>Product batches</description>
    </items>
    <items>
      <name>Document_Production</name>
      <description>Production</description>
    </items>
    <items>
      <name>Document_Manufacturing</name>
      <description>Production (ver. 2)</description>
    </items>
    <items>
      <name>Document_ProductionOrder</name>
      <description>Production order</description>
    </items>
    <items>
      <name>Document_ProductionTask</name>
      <description>Production task</description>
    </items>
    <items>
      <name>Document_PurchaseOrder</name>
      <description>Purchase order</description>
    </items>
    <items>
      <name>Document_Quote</name>
      <description>Quote</description>
    </items>
    <items>
      <name>Document_ReconciliationStatement</name>
      <description>Reconciliation statement</description>
    </items>
    <items>
      <name>Document_RequestForQuotation</name>
      <description>Request for quotation</description>
    </items>
    <items>
      <name>Document_RequisitionOrder</name>
      <description>Requisition order</description>
    </items>
    <items>
      <name>Document_RMARequest</name>
      <description>RMA request</description>
    </items>
    <items>
      <name>Catalog_SalesGoalSettings</name>
      <description>Sales goal settings</description>
    </items>
    <items>
      <name>Document_SalesInvoice</name>
      <description>Sales invoice</description>
    </items>
    <items>
      <name>Document_SalesOrder</name>
      <description>Sales order</description>
    </items>
    <items>
      <name>Document_PlannedInteraction</name>
      <description>Scheduled interaction</description>
    </items>
    <items>
      <name>Catalog_BusinessUnits</name>
      <description>Structural units</description>
    </items>
    <items>
      <name>Document_SubcontractorInvoiceIssued</name>
      <description>Subcontractor invoice issued</description>
    </items>
    <items>
      <name>Document_SubcontractorInvoiceReceived</name>
      <description>Subcontractor invoice received</description>
    </items>
    <items>
      <name>Document_SubcontractorOrderIssued</name>
      <description>Subcontractor order issued</description>
    </items>
    <items>
      <name>Document_SubcontractorOrderReceived</name>
      <description>Subcontractor order received</description>
    </items>
    <items>
      <name>Document_SupplierInvoice</name>
      <description>Supplier invoice</description>
    </items>
    <items>
      <name>Document_SupplierQuote</name>
      <description>Supplier invoice for payment</description>
    </items>
    <items>
      <name>Catalog_SuppliersProducts</name>
      <description>Supplier products</description>
    </items>
    <items>
      <name>Document_SMSMessage</name>
      <description>Text message</description>
    </items>
    <items>
      <name>Document_TransferOrder</name>
      <description>Transfer order</description>
    </items>
    <items>
      <name>Catalog_Users</name>
      <description>Users</description>
    </items>
    <items>
      <name>Document_VATInvoiceForICT</name>
      <description>VAT invoice for ICT</description>
    </items>
    <items>
      <name>Document_WorkOrder</name>
      <description>Work order</description>
    </items>
  </predefined>
  <attributes>
    <name>AttributesNumber</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>InfoCount</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Used</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>AdditionalAttributes</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AdditionalAttributesAndInfo</types>
      </type>
    </attributes>
    <attributes>
      <name>DeletionMark</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>AdditionalInfo</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AdditionalAttributesAndInfo</types>
      </type>
    </attributes>
    <attributes>
      <name>DeletionMark</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Австралия/src/Catalogs/ProductsCategories/ObjectModule.bsl
#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region EventHandlers

Procedure FillCheckProcessing(Cancel, CheckedAttributes)
	
	If Not UseBatches Then
		DriveServer.DeleteAttributeBeingChecked(CheckedAttributes, "BatchSettings");
	EndIf;
	
EndProcedure

// Procedure - BeforeWrite event handler.
//
Procedure BeforeWrite(Cancel)
	
	If DataExchange.Load Then
		Return;
	EndIf;
	
	If Not Cancel Then
		
		WriteAdditionalAttributesCatalog(PropertySet, Catalogs.AdditionalAttributesAndInfoSets.Catalog_Products);
		WriteAdditionalAttributesCatalog(SetOfCharacteristicProperties, Catalogs.AdditionalAttributesAndInfoSets.Catalog_ProductsCharacteristics);
		
	EndIf;	
	
EndProcedure

// Procedure - event handler  AtCopy.
//
Procedure OnCopy(CopiedObject)
	
	PropertySet						= Undefined;
	SetOfCharacteristicProperties	= Undefined;
	UseMatrixSelectionForm			= False;
	
EndProcedure

#EndRegion

#Region Private

Procedure WriteAdditionalAttributesCatalog(SetOfProperties, SetParent)
	
	If Not ValueIsFilled(SetOfProperties) Then
		ObjectSet = Catalogs.AdditionalAttributesAndInfoSets.CreateItem();
	Else
		ObjectSet = SetOfProperties.GetObject();
		LockDataForEdit(ObjectSet.Ref);
	EndIf;
	
	ObjectSet.Description	= Description;
	ObjectSet.Parent		= SetParent;
	ObjectSet.DeletionMark	= DeletionMark;
	ObjectSet.Used			= True;
	ObjectSet.Write();
	SetOfProperties = ObjectSet.Ref;

EndProcedure

#EndRegion

#EndIf
